Revit 2026 API

# VoltageTypeSet Methods

---

The VoltageTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every voltage type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a voltage type within the set. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a specified voltage type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified voltage type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

VoltageTypeSet Class

Autodesk.Revit.DB.Electrical Namespace